"""
问题描述
有一种虚拟 IPv4 地址，由 4 个小节组成，每节的范围为
0
∼
255
0∼255，以 # 号间隔。这种虚拟 IPv4 地址可以转换为一个 32 位的整数。例如：

128#0#255#255 转换为 32 位整数的结果为 2147549183（0x8000FFFF）
1#0#0#0 转换为 32 位整数的结果为 16777216（0x01000000）
现给出一个以字符串形式表示的虚拟 IPv4 地址，要求将其转换为对应的整数。转换时需要注意以下限制：

第 1 小节的范围为
1
∼
128
1∼128。
其他小节的范围为
0
∼
255
0∼255。
每个 IPv4 地址只能对应到唯一的整数上。
如果输入的 IPv4 地址非法，则返回 "invalid IP"。

输入格式
输入一行，为虚拟 IPv4 地址格式的字符串。

输出格式
输出一行，为转换后的整数或 "invalid IP"（如果输入非法）。

样例输入1
100#101#1#5

样例输出1
1684340997

样例输入2
1#2#3
样例输出2
invalid IP

样例输入3
01#01#01#01
样例输出3
invalid IP

作者：程序员基德
链接：https://www.nowcoder.com/discuss/701790013125623808?sourceSSR=users
来源：牛客网
"""